joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
static int IO_digitalRead(int pin) {
#if USE_PCF8574
  if (pin < 0) {
    return HIGH;
  }
  if (IO_isPcfPin(pin)) {
    if (!pcf8574Available) {
      return HIGH;
    }
    uint8_t p = static_cast<uint8_t>(pin - IO_PCF_BASE);
    if (p > 7) {
      return HIGH;
    }
    if (pcf8574UseInterrupt) {
      uint32_t now = millis();
      if (pcf8574InterruptPending || (now - pcf8574CachedAtMs) > 50) {
        bool ok = false;
        pcf8574CachedIn = pcf8574ReadByte(PCF8574_ADDRESS, &ok);
        pcf8574CachedAtMs = now;
        pcf8574InterruptPending = false;
      }
      return (pcf8574CachedIn & (1U << p)) ? HIGH : LOW;
    }
    bool ok = false;
    pcf8574CachedIn = pcf8574ReadByte(PCF8574_ADDRESS, &ok);
    return (pcf8574CachedIn & (1U << p)) ? HIGH : LOW;
  }
#endif
  return digitalRead(static_cast<uint8_t>(pin));
}

static void IO_digitalWrite(int pin, uint8_t value) {
#if USE_PCF8574
  if (pin < 0) {
    return;
  }
  if (IO_isPcfPin(pin)) {
    if (!pcf8574Available) {
      return;
    }
    uint8_t p = static_cast<uint8_t>(pin - IO_PCF_BASE);
    if (p > 7) {
      return;
    }
    if (value != LOW) {
      pcf8574Out |= (1U << p);
    }
    pcf8574WriteByte(PCF8574_ADDRESS, pcf8574Out);
    return;
  }
#endif
  digitalWrite(static_cast<uint8_t>(pin), value);
}

#define pinMode(pin, mode) IO_pinMode((pin), (mode))
#define digitalRead(pin) IO_digitalRead((pin))
#define digitalWrite(pin, value) IO_digitalWrite((pin), (value))

// ========== CONFIGURAÇÕES SUPABASE ==========
const char* SUPABASE_URL = "https://mkoqceekhnkpviixqnnk.supabase.co";
const char* SUPABASE_KEY = "sb_publishable_HLUfLEw2UuIWjzd5LfqLkw_oaodzV7V";
static String supabaseUrl = SUPABASE_URL;
static String supabaseKey = SUPABASE_KEY;
const char* SENHA_AP = "12345678";                  // Senha da rede de configuração (mínimo 8 caracteres)
// ============================================

static String mqttHost = "test.mosquitto.org";
static uint16_t mqttPort = 1883;
static String mqttUser = "";
static String mqttPass = "";
static bool mqttUseTls = false;
static String mqttClientId = "";
static bool mqttCleanSession = true;
static uint32_t mqttRxCount = 0;
static uint32_t mqttTxCount = 0;
static uint32_t mqttLastRxMs = 0;
static uint32_t mqttLastTxMs = 0;
static SemaphoreHandle_t mqttMutex = NULL;
static QueueHandle_t mqttCommandQueue = NULL;
static QueueHandle_t mqttTxQueue = NULL;
static TaskHandle_t mqttTaskHandle = NULL;
typedef struct { char cmd[64]; } MqttCmdItem;
typedef struct { char topic[96]; char payload[768]; bool retain; } MqttTxItem;
String MQTT_TOPIC_BASE = "";
static bool ignoreLimitLocks = (TEST_MODE != 0);
static bool ignoreGavetaLock = (TEST_MODE != 0);
static volatile bool mqttStatusDirty = false;
static uint32_t mqttLastStatusPublishMs = 0;
static bool otaInProgress = false;
static bool otaEnabled = false;
static String otaManifestUrl = "";
static uint32_t otaIntervalSec = 21600;
static uint32_t otaNextCheckAtMs = 0;
static String otaPendingVersion = "";

typedef struct {
  bool available;
  bool mandatory;
  String version;
  String url;
  String md5;
  int size;
} OtaInfo;

static inline bool mqttLockMs(uint32_t ms) {
  if (!mqttMutex) {
    return true;
  }
  return xSemaphoreTakeRecursive(mqttMutex, pdMS_TO_TICKS(ms)) == pdTRUE;
}

static inline void mqttUnlock() {
  if (!mqttMutex) {
    return;
  }
  xSemaphoreGiveRecursive(mqttMutex);
}

WiFiClient mqttPlainClient;
WiFiClientSecure mqttSecureClient;
PubSubClient mqttClient(mqttPlainClient);
static bool beepNetMqttOkDone = false;
static bool beepMqttErrorDone = false;
static bool beepSupabaseOkDone = false;
static uint32_t beepSupabaseErrorNextMs = 0;
static uint32_t mqttReadyAtMs = 0;
static bool mqttConnectEnabled = false;
static bool audibleErrorBeeps = true;
static uint32_t bootStartedAtMs = 0;
static uint32_t wifiOkAtMs = 0;
static uint32_t wifiLostAtMs = 0;
static uint32_t mqttOkAtMs = 0;
static uint32_t mqttLostAtMs = 0;
static uint32_t supabaseOkAtMs = 0;
static uint32_t supabaseFailAtMs = 0;
static uint32_t alarmNextMs = 0;

static bool beepSeqActive = false;
static uint8_t beepSeqRemaining = 0;
static uint32_t beepSeqNextMs = 0;
static bool beepSeqBuzzerOn = false;
static bool beepSeqRestorePulse = false;
static uint16_t beepSeqOnMs = 100;
static uint16_t beepSeqOffMs = 120;
static bool buzzerTestEnabled = false;
static bool buzzerTestIsOn = false;
static uint32_t buzzerTestNextOnMs = 0;
static uint32_t buzzerTestOffAtMs = 0;
static bool trendDebugEnabled = false;
static uint32_t trendDebugNextMs = 0;
static uint32_t trendDebugIntervalMs = 500;

// Número de série único baseado no MAC ID do ESP32
String NUMERO_SERIE_CADEIRA = "";
String NOME_DISPOSITIVO = "";  // Nome único: CadeiraOdonto-XXXX (usado em WiFi e Bluetooth)

Preferences preferences;
String comandoBLE = "";

#if HAS_BLE
BLEServer* pServer = NULL;
BLECharacteristic* pCharacteristicTX = NULL;
BLECharacteristic* pCharacteristicRX = NULL;
bool bleClienteConectado = false;
static bool bleInicializado = false;
static BLEAdvertising* bleAdvertising = NULL;
static bool bleAdvertisingAtivo = false;

#define SERVICE_UUID           "6E400001-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_RX "6E400002-B5A3-F393-E0A9-E50E24DCCA9E"
#define CHARACTERISTIC_UUID_TX "6E400003-B5A3-F393-E0A9-E50E24DCCA9E"
#else
bool bleClienteConectado = false;
#endif
WiFiManager wifiManager;

// VariÃ¡veis de controle Supabase
bool cadeiraHabilitada = true;
bool manutencaoNecessaria = false;
bool supabaseMaintenanceRequestSent = false;
String supabaseUserId = "";
unsigned long ultimaAtualizacaoSupabase = 0;
const unsigned long INTERVALO_ATUALIZACAO_SUPABASE = 900000;  // Atualiza a cada 15 minutos
unsigned long ultimaVerificacaoStatus = 0;
const unsigned long INTERVALO_VERIFICACAO_STATUS = 900000;   // Verifica status a cada 15 minutos
unsigned long ultimoMonitoramentoSistema = 0;
const unsigned long INTERVALO_MONITORAMENTO = 10000;         // Monitora a cada 10 segundos

// MQTT
// Controle de publicação MQTT diária - removido, agora só recebe comandos

