joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
// HorÃ­metro
float horimetro = 0;
unsigned long tempoInicioMotor = 0;
bool motorLigado = false;
unsigned long totalMillisMotor = 0;

// Controle de verificação de status
bool primeiraVerificacaoStatus = true;

// Timeout para portal de configuraÃ§Ã£o (3 minutos)
const int TIMEOUT_CONFIG_WIFI = 180;

// Logo VIP Hospitalar em Base64 (WebP)
const char LOGO_VIP_HOSPITALAR[] PROGMEM = R"rawliteral(
<style>
  .logo-container { text-align: center; margin: 20px 0; }
  .logo-img { max-width: 150px; height: auto; }
  .titulo-empresa { color: #0066cc; font-size: 18px; font-weight: bold; margin-top: 10px; }
  .subtitulo { color: #666; font-size: 12px; }
</style>
<div class="logo-container">
  <img class="logo-img" src="data:image/webp;base64,UklGRgQPAABXRUJQVlA4WAoAAAAQAAAAlQAAlQAAQUxQSHEHAAABoMb8/+O0+d552+wNIU4aEqfsbDDZ6Z4MZXST1b1bshQUd++9S0W690KIZinq3kUg1IGCUHZRUISQhSzrZJ2+L+7w37k7W33XiJgA/C9cW0H5wvra6Z7UwnneG30jE9Gx4a+2TEkdbA1jjPfJ7BTB3TbOuNWvq1KDzghFh/0pgLyFCewtSX4VxxPBJ+3JzvkOEzpeluxqlcTwp2S3k4l2J7m+hM1PbhITfnVysyfupv8ipFjC1iU39CdsfpLblTBPkgtMJKgbBs1qbdu8qW1DlmQ5js7EjAWMIdVuKJABOb91jmQ1qDmZkOcdxvBvcMn+uQEnnNdNtxzpykTszYEhpZAb0049+fLes+EMSVYD+ZmY0PFpMKb/YsD/rlNa/QJw7gzLgXuXItA/Gwa9tBDwf+Bx3LQdyGu0HqD2YHgydeheN4zamgZMPXXgzwM+wLvRipC24qlBheTYlzeeJcGwl5QA/i9LA2+VAYWXWxJgTyutmRvIdUkw8JTLAf9uBxpDwMXTLMqc92aj9HkHpvYgsw0pZMlGj6NQgm2qd0NpKoGy9hIJkIraZ+FMBx5vF66XxKa1x9uWD0y7YXPca9OA2scfTuiD7e0P79q8otgtTwJH06YLLtjU4sAZd4YiFB2qEVvOeEergMsY/yE/0MwzOvH19tkOPQM73xXi70UmaDozJI931hgNjv1CPOqzHpIPZxgMRQeF2OGxIrVrhsEQ+FMoss1mQeSfJQbD7FERsl2yIg6cZTA0jgnFzpWsiN1pBpNvVEV4uMqS+IDBIN8sxKMzLYkBg8HeKcSBdEvqtBsMWV1CfNVjoGbjjFQYDTk9QnzBbRz/mqZENm9497AqpLbJRsOUESFlp3ESbqv4VIhfewyH+qgIY+eZDfAMCUXzjYclIyI8tcx0KDopwktNIK8V4qEK09keUEWeNwHkZ4X4Z7rZcHFM5E8zwPF4VIRfZ5qtLiKimgJpHwjFnncuM9fiqIhiDmROiFDZcZ6ppCtjIodMgtI+EapHTeXtpugzZsG8YRFB410XE7rINNJFVlI/TuES0wA3hA1nc7sS6gm8GqXwAY+J7NujRlu6tyehP0Uprt4tmwiud4zWRMOOLYCp7Xut6gXZXCj62pqUWTB7+aAldcD85aetR+1xWwCaxy2ntxRWKG9WLCYyHdYo32wpSlcJrNL+joUod2bAOnO+sgr14FwZVprdbQGRQwce8Euw2JJTZoj80KX/yauP333NUr9PgvXWRUzQW+bSdzrssgRrlpaOGO+HLCRB+YrUBPJLqQkcj0dTEqR9lJogI5yawN+fmmDBcGoiXZSaADeFUxP79mhKAtf7qQkc+1MTFB9ITVB+KDVBxWBqgosCiWkW+Ck7+ch2IHfJ4rjnu4C8xQ1xV9uTz3+dUlJyPxDaUazZFgo1aeQZbb+MDjw+06bjXdsbHnqsSkbBtlBo17bNy32A/ZpQqEK6KaT/QDnguO2+0H3nalytoQf9k0iXhkKhdXZNUygU2nnv6jK7YbLI8HzNOPksANeGKLVjoXQAnt0qSY7no2qUut+Vwb2fXG0b4KQtQJlKcliT/jW5eJLMr0n+OUXzFnWjj9lMYt85Qf1Yjw24MsbTHW8p77ri4AfuRNxNDpIlkzRMUjvK42FlVVxULzHJtWR4R44t7YYIebsEhawH0kqgGcz3XXKcsTIdqayyguT75dUZkA9TXRjh4yLyFh5ee5AfOfVus2X/SXZKRhvTyMPkMw4A0n1kbx5I3u6BtmqU/V64u8k6HQAguQUA/GSPr5/7fQIZh9md9QKVUr1W4Dryc4dxlBdaVq9ujGoKSAagLVKoNKCbDO/dHpAnK+gl5yRgB1lve4zHywWWkTuldeSmOLaTHZJx4nwWS0nadNwHyGbk7Y2SZE+OZqLz/RHyZKFY5ncczEIwyhul+LrIBcgm+yWd3fW3qozUwzjqyf6BgT5VU0/SoeP5gWwEMhp3nyT5hkY3tsMmNn+ULzmQ8wt7vXG5wqQDGCTzdEhG9q+RDDTR6PP5vGFNPsmATvYEuQoAHAUdpCpNcuomN4SkzSo7FtTU/UBWxrWCjJRVV3SRt+kcPc2jCyUYKDwfAMY00p/kO14AtrfIrzPgKwSQTlKuGuVgvtMuAWK+fk7+js4yjbybk/e4NTvujfFdt/HGNVilMPpCdcGsHSq5Bnj+l2Vu1+XkGKpG2e+FrlANGRkaGho6TI46NB2rV69eXDlA5fjQ0NDhCEeqNa35veQGs9i3q1RH+o7GyC9lzFI51tN1mlyn40vQO+SDPp/Pl0ayRqP9JRTmJyU+ny/vSTXWKmuwjjydZ5iYcnqeZlRRngUgXzwQURRF6d9oA7yvnlQURRm51Y7KEaXPO0mPojRrFEW5F54xJVoG7TMx5dXs/Yru6LASuVoCgJUTyreeTkW5FvKfMaXHYxD7kmCdT7OoITgT2qJFwWAwWCwBgG12MBgMnm0DvHUNc2Q9uSIYzNU0BIMlcDYE6+062UuCVe6KoG5DQ7A+E1pfXbDBPjMYzAdKlwTrfQb5v78AVlA4IGwHAACwKQCdASqWAJYAPm0ylUekIyIhKpD5iIANiU3eUKtJBNE6r/IOzowv3Dzla9/avwR+Q3TXm264P5Xn7/kvs3+4D3Bf0d/V3rj+YD9uP2q92T/b/rB7ufQH/lH+q60z0AP1y9Ln9yvhE/aX9svbCzXDtBr1PPj2eys+CfHV31xm/QXRd+uP9jvYA/VUzMkgRAy33acP12v9QLFBTO3Qdxjr5JAYDAoustLzfAPlvybg/fCSYDlXXxZ90AYce/PZA5RUXMT6kXQdcq/iH45Em5363F9v65poEcElTisHBLF+WS7M1ZY1ppbfZRKWlHlZAlb8ml/sD+ZYn92I2gPX1HdxwzgDOLAMx17W9BDxXdZUSnpYPqQHYSCb+v4I0y/YsgL5rOaBUrFN95otjWMRHdLf4eGGwTCQXbn+c04IBCcckiCk7LjP+R9WIxmIs0s5EK7tVx3yPgAA/vz4QAs9k7o4T0JD0/q2485zyDdFsiIowR/kipHrmr6MpqaxQtIpJ/cSIvK7yre5Kv+Vf5/EAr7laKrS/zVCCPWlwKWJhB+zUXvi/D/AII9odRtyTaQY3qnX5BygBCK/a1Io0UGAnDJpSjWBrtICOHxN5fcciWj0SIHMmKdVZOgQVT2Eb7gdCD6WQntXTC5L62s2tvIXZjjPOjxdLVBebRUKetarxkH+gZziydU6LxqsJLcWQFsQxzYjA96pr4UOgMQFhJtZdgii8eEABb4z97ODA7ie8qNA+be9+wW8ZQHOpYnkhYmoA1hI7nc/yRoE4CCxWuRxw/OyoeDGHNVfopoyku3/Vyf8QMNii9qjMYbscFxCFFeJ2VW3R7o65WjvgF103DZV2YXkI9BLG5Btw5mExWeze1USUez3qfbTW5WXC7iE87D6mBaIBrNty09adovxtuxz9V722f3Mmxfobr4BH8WjBY1xIw/sQ1TbvcYmtCgaM+54rZIrcqpgcmNndVMfNCQLPqDNYmx9aKAsKxUrETQNGbLGqMNsmExy6GzVoZQJmsb42FmyJvaRpZrcrrSiekQJhn28Uym9xUSEuFnv1i1ur+o5oELN+7hJb52vFx8QQTUhaN3xIw2mcKSXiys+h+4/Ot73p8fIJSMYQtzUKuCHlTMympA623gpriD4L91CJGvy+s0th/Pt6gPqAGywOSJcYoeywJYkVoO8TjbwSvMfGERx8p7PI4BPTbH9VbyrssKTGJadEPB/zms5MkkaI8+TNYFi4zenGHKDKQTih6tSmn1J6EPuDD0OzCKJwb1EmYq8zPnkCG22M7qxHqWiqWgXYC34V6oLF2buQkPwNK78c8wsby7+hp8MbPY/54B8fyvSeYeh1uPcXNUBXVsHWdFHRg+6kXloOjKNZA3LBDG/LvIaHnwtuC9dZbrTNOmP2T3JQtXhmqjOjwr+ilH/sijsxS4TJqQAiWhUDmoy2drFVIFowSUr6JvFQs7goNrftDvM6ZS0dfpSwYtGqFggOBZphw3+z1RRLLvrQv5Fkbl/Vq0svmc+5Hzb6Pai1WMU8cJaK9g0CkC0X0BnLSNTfzWaVBgidf1ol+fNhBkPTJEKBOaRrydUJ2PiCGzVR5dLlbqZd1BNfAcBfw4OTJbgjQhJDZ+QcUpkLif5b2XKrscJhYu0APltZ0iko26GkyJNDM0PC0ob9vH6giKZsTZwtg8cA/QY2mTretAO5PzSSmO7tokVq/lHifkwi7/gw9/caVUStQq4mUwzxIHI/RE13gAhzOUGRrJwT/v+RKHl6tGXNjfC/idTX5wqEjo3xcb5v6bS7cf7DvjNsAAQssahgTGFVM3snCO4IDUqb5SJObHOft7W6qZHO51vfsE4gHWe3bS9jUjoDyICfdKFCRPuXc7KjVAUlwKkvKZl/r6v9mTY0Azzak59ylVWGhaDEcr/pLTcX4EVBWAEfnzuJVT7lSPxUSRb1DaKnpTi31U5lvIg9C3q82OMLKzbefVK1Jd1aRzSau6NkCF0HjDoVx8AxofvEjB6xhMLUivbso9Q94aqmHTC6gC2+Juw+BTrEAfskaBbCl6lai7Ky8fWYgj6Zk5qAYU9MaqHqtszO8u8KUHP29ASYAaFzpbWznJRL529w1Jq1IROXKbuZxFLi4AnRW2Cix8mEu/M65pMegYkl6g/MPYDF3UTzKiRtMIvVcm0mjAJ/Cd8DffkIjam/JDFUuNWIYcJrmJ3WPMfJW9vvmsPq+3waOrKesZZuUJbnXl0U7hF6lChI/7WzshGJH8RYbzUcwxJp/d2SmSX4LNuYzwxk+Py7e5JjMUr0dRcHk1n3HwhCL/WnNqfa4j7F9UF0e2Fx+injOSO4EBI0d7l8jZjcfEVlINQMRfLhtGE5wixg6TOFQBKKsaQLj3eISmwt6bIuRrY8o8E414CaA3lPZfrpLhSMHnzmvbS4evHq6WZsG/bouG7+e0rX1MzUA/lp0P+s/v8aT8M0arojZ4wZT64/X8FH0hXk6b+skJDi2OJtL9ThZK+o7u/F5+uRgaTP49njThAT3eGO7IAAAAAAAAA" alt="VIP Hospitalar">
  <div class="titulo-empresa">VIP HOSPITALAR</div>
  <div class="subtitulo">Cadeira OdontolÃ³gica</div>
</div>
)rawliteral";

