joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
static void otaTick() {
  if (!otaEnabled || otaManifestUrl.length() == 0) {
    return;
  }
  if (otaInProgress) {
    return;
  }
  if (WiFi.status() != WL_CONNECTED) {
    return;
  }
  uint32_t now = millis();
  if (otaNextCheckAtMs == 0) {
    otaNextCheckAtMs = now + 30000;
    return;
  }
  if (now < otaNextCheckAtMs) {
    return;
  }
  otaNextCheckAtMs = now + (otaIntervalSec * 1000UL);
  OtaInfo info;
  if (otaFetchManifest(info) && info.available) {
    otaDownloadAndUpdate(info);
  }
}

static bool mqttIsControlCommand(const String& cmdUpper) {
  return cmdUpper == "DE" || cmdUpper == "SE" || cmdUpper == "SA" || cmdUpper == "DA" ||
         cmdUpper == "SP" || cmdUpper == "DP" || cmdUpper == "TS" || cmdUpper == "TD" || cmdUpper == "TREND_TEST" || cmdUpper == "RF" || cmdUpper == "VZ" ||
         cmdUpper == "PT" || cmdUpper == "M1" || cmdUpper == "STOP" || cmdUpper == "AT_SEG" ||
         cmdUpper == "STATUS";
}

static void mqttPublishTxCmd(const String& cmdUpper, const char* origin) {
  if (!mqttClient.connected()) {
    return;
  }
  if (origin && String(origin) == "MQTT") {
    return;
  }
  if (cmdUpper.startsWith("MQTT_")) {
    return;
  }
  if (!mqttIsControlCommand(cmdUpper)) {
    return;
  }
  mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", cmdUpper, false);
}

void mqttCallback(char* topic, byte* payload, unsigned int length) {
  Serial.print("[MQTT] Mensagem recebida no tópico: ");
  Serial.println(topic);
  
  String message = "";
  for (int i = 0; i < length; i++) {
    message += (char)payload[i];
  }
  mqttRxCount++;
  mqttLastRxMs = millis();
  Serial.print("[MQTT_RX] Payload: ");
  Serial.println(message);
  
  String cmd = message;
  cmd.trim();
  if (cmd.startsWith("CMD:")) {
    cmd = cmd.substring(4);
  }
  cmd.trim();
  cmd.toUpperCase();
  if (cmd.length() == 0) return;

  if (cmd == "STATUS") {
    publicaStatusMQTT();
    return;
  }

  if (mqttCommandQueue) {
    MqttCmdItem item;
    memset(&item, 0, sizeof(item));
    cmd.toCharArray(item.cmd, sizeof(item.cmd));
    xQueueSend(mqttCommandQueue, &item, 0);
  }
}

void reconnectMQTT() {
  if (!mqttClient.connected()) {
    static uint32_t mqttNextAttemptMs = 0;
    uint32_t now = millis();
    if (static_cast<int32_t>(now - mqttNextAttemptMs) < 0) {
      return;
    }

    Serial.print("[MQTT] Tentando conectar...");
    
    String clientId = mqttClientId.length() > 0 ? mqttClientId : ("ESP32-" + NUMERO_SERIE_CADEIRA);
    String willTopic = MQTT_TOPIC_BASE + "lwt";

    bool locked = mqttLockMs(100);
    if (!locked) {
      Serial.println("falhou, mutex");
      mqttNextAttemptMs = now + 1000;
      return;
    }

    if (mqttUser.length() > 0 && mqttPass.length() == 0) {
      Serial.println("falhou, senha vazia (use MQTT_PASS=...)");
      mqttUnlock();
      mqttNextAttemptMs = now + 5000;
      return;
    }

    bool ok = false;
    if (mqttUser.length() == 0 && mqttPass.length() == 0) {
      ok = mqttClient.connect(
        clientId.c_str(),
        "",
        "",
        willTopic.c_str(),
        1,
        true,
        "offline",
        mqttCleanSession
      );
    } else if (mqttUser.length() > 0) {
      ok = mqttClient.connect(
        clientId.c_str(),
        mqttUser.c_str(),
        mqttPass.c_str(),
        willTopic.c_str(),
        1,
        true,
        "offline",
        mqttCleanSession
      );
    } else {
      Serial.println("falhou, usuario vazio");
      mqttUnlock();
      mqttNextAttemptMs = now + 5000;
      return;
    }
    if (ok) {
      Serial.println("conectado!");
      beepMqttErrorDone = false;
      mqttOkAtMs = millis();
      mqttLostAtMs = 0;
      
      // Inscreve-se no tópico de comandos
      String commandTopic = MQTT_TOPIC_BASE + "command";
      mqttClient.subscribe(commandTopic.c_str(), 0);
      Serial.print("[MQTT] Inscrito no tópico: ");
      Serial.println(commandTopic);

      mqttClient.publish(willTopic.c_str(), "online", true);
      mqttTxCount++;
      mqttLastTxMs = millis();

      publicaStatusMQTT();

      mqttUnlock();

      // Não publica status inicial
      if (!beepNetMqttOkDone && WiFi.status() == WL_CONNECTED) {
        bip(); delay(120);
        bip(); delay(120);
        bip();
        Serial.println("[BUZZER] WiFi+MQTT OK");
        beepNetMqttOkDone = true;
        supabaseLogUsage("MQTT_CONNECTED");
      }
      
    } else {
      Serial.print("falhou, rc=");
      Serial.print(mqttClient.state());
      Serial.println(" tentando novamente em 5 segundos");
      mqttUnlock();
      mqttNextAttemptMs = now + 5000;
    }
  }
}

static void mqttTaskMain(void* pvParameters) {
  for (;;) {
    if (otaInProgress) {
      if (mqttClient.connected()) {
        if (mqttLockMs(50)) {
          mqttClient.disconnect();
          mqttUnlock();
        }
      }
      vTaskDelay(pdMS_TO_TICKS(250));
      continue;
    }
    if (WiFi.status() == WL_CONNECTED) {
      uint32_t now = millis();
      if (!mqttConnectEnabled) {
        vTaskDelay(pdMS_TO_TICKS(50));
        continue;
      }
      if (mqttReadyAtMs != 0 && static_cast<int32_t>(now - mqttReadyAtMs) < 0) {
        vTaskDelay(pdMS_TO_TICKS(50));
        continue;
      }
      reconnectMQTT();
      if (mqttClient.connected()) {
        if (mqttLockMs(50)) {
          mqttClient.loop();
          if (mqttTxQueue) {
            MqttTxItem item;
            while (xQueueReceive(mqttTxQueue, &item, 0) == pdTRUE) {
              if (!mqttClient.connected()) {
                continue;
              }
              bool ok = mqttClient.publish(item.topic, item.payload, item.retain);
              mqttTxCount++;
              mqttLastTxMs = millis();
              Serial.print("[MQTT_TX] ");
              Serial.print(ok ? "OK " : "FAIL ");
              Serial.print("topic=");
              Serial.print(item.topic);
              Serial.print(" payload=");
              Serial.println(item.payload);
            }
          }
          mqttUnlock();
        }
      }
    } else {
      beepNetMqttOkDone = false;
      if (mqttClient.connected()) {
        if (mqttLockMs(50)) {
          mqttClient.disconnect();
          mqttUnlock();
        }
      }
    }
    vTaskDelay(pdMS_TO_TICKS(50));
  }
}

static bool isGavetaAbertaRaw();

void publicaStatusMQTT() {
  if (mqttClient.connected()) {
    String statusTopic = MQTT_TOPIC_BASE + "status";
    StaticJsonDocument<896> doc;
    doc["fwVersion"] = FIRMWARE_VERSION;
    doc["otaEnabled"] = otaEnabled;
    if (otaPendingVersion.length() > 0) {
      doc["otaPending"] = otaPendingVersion;
    }
    doc["wifiConnected"] = (WiFi.status() == WL_CONNECTED);
    if (WiFi.status() == WL_CONNECTED) {
      doc["wifiSsid"] = WiFi.SSID();
      doc["wifiIp"] = WiFi.localIP().toString();
    }
    doc["hourMeter"] = horimetro;
    doc["enabled"] = cadeiraHabilitada;
    doc["maintenanceRequired"] = manutencaoNecessaria;
    doc["reflectorOn"] = estado_r;
    doc["backUpOn"] = estado_se;
    doc["backDownOn"] = estado_de;
    doc["seatUpOn"] = estado_sa;
    doc["seatDownOn"] = estado_da;
    doc["upperLegsOn"] = estado_sp;
    doc["lowerLegsOn"] = estado_dp;
    doc["trendUpOn"] = estado_trend_sobe;
    doc["trendDownOn"] = estado_trend_desce;
    doc["backPosition"] = incoder_virtual_encosto_service;
    doc["seatPosition"] = incoder_virtual_asento_service;
    doc["legPosition"] = incoder_virtual_perneira_service;
    doc["gavetaOpen"] = isGavetaAbertaRaw();
    doc["gavetaLockIgnored"] = ignoreGavetaLock;
    if (TREN_INT_DESCE >= 0) doc["trenIntDown"] = (digitalRead(TREN_INT_DESCE) == HIGH);
    if (INT_TREND_DESCE >= 0) doc["trendIntDown"] = (digitalRead(INT_TREND_DESCE) == HIGH);
    if (TREN_INT_SOBE >= 0) doc["trenIntUp"] = (digitalRead(TREN_INT_SOBE) == HIGH);
    if (INT_TREND_SOBE >= 0) doc["trendIntUp"] = (digitalRead(INT_TREND_SOBE) == HIGH);
    String ts = getTimestamp();
    if (ts.length() > 0 && ts != "null") {
      doc["timestamp"] = ts;
    }

    String statusMsg;
    serializeJson(doc, statusMsg);
    mqttEnqueuePublish(statusTopic, statusMsg, true);
  }
}

