joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
#if HAS_BLE
static void beepSeqStart(uint8_t count, uint16_t onMs, uint16_t offMs);

class MyServerCallbacks: public BLEServerCallbacks {
  void onConnect(BLEServer* pServer) {
    bleClienteConectado = true;
    bleAdvertisingAtivo = false;
    beepSeqStart(4, 100, 120);
    Serial.println("\n====================================");
    Serial.println("  [BLE] DISPOSITIVO CONECTADO!");
    Serial.println("====================================");
    Serial.print("Total de clientes conectados: ");
    Serial.println(pServer->getConnectedCount());
    Serial.println("====================================\n");
  };

  void onDisconnect(BLEServer* pServer) {
    bleClienteConectado = false;
    Serial.println("\n====================================");
    Serial.println("  [BLE] DISPOSITIVO DESCONECTADO");
    Serial.println("====================================");
    delay(500);
    if (WiFi.status() == WL_CONNECTED && mqttClient.connected()) {
      pServer->startAdvertising();
      bleAdvertisingAtivo = true;
      Serial.println("[BLE] Advertising reiniciado");
      Serial.println("Aguardando nova conexao...");
    } else {
      bleAdvertisingAtivo = false;
      Serial.println("[BLE] Advertising bloqueado (aguardando WiFi+MQTT)");
    }
    Serial.println("====================================\n");
  }
};

class MyCallbacks: public BLECharacteristicCallbacks {
  void onWrite(BLECharacteristic *pCharacteristic) {
    std::string rxValue = pCharacteristic->getValue();
    
    if (rxValue.length() > 0) {
      comandoBLE = "";
      for (int i = 0; i < rxValue.length(); i++) {
        comandoBLE += rxValue[i];
      }
      comandoBLE.trim();
      Serial.print("[BLE] Comando recebido: ");
      Serial.println(comandoBLE);
    }
  }
};
#endif

#if HAS_BLE
static void bleAtualizaDisponibilidade() {
  bool permitido = (WiFi.status() == WL_CONNECTED && mqttClient.connected());
  if (!permitido) {
    if (bleAdvertising && !bleClienteConectado) {
      bleAdvertising->stop();
      bleAdvertisingAtivo = false;
    }
    return;
  }
  if (!bleInicializado) {
    Serial.println("\n====================================");
    Serial.println("  INICIALIZANDO BLE");
    Serial.println("====================================");
    Serial.print("Inicializando BLE com nome: ");
    Serial.println(NOME_DISPOSITIVO);

    BLEDevice::init(NOME_DISPOSITIVO.c_str());
    pServer = BLEDevice::createServer();
    pServer->setCallbacks(new MyServerCallbacks());

    BLEService *pService = pServer->createService(SERVICE_UUID);
    pCharacteristicTX = pService->createCharacteristic(
      CHARACTERISTIC_UUID_TX,
      BLECharacteristic::PROPERTY_NOTIFY | BLECharacteristic::PROPERTY_WRITE_NR
    );
    pCharacteristicTX->addDescriptor(new BLE2902());

    pCharacteristicRX = pService->createCharacteristic(
      CHARACTERISTIC_UUID_RX,
      BLECharacteristic::PROPERTY_WRITE
    );
    pCharacteristicRX->setCallbacks(new MyCallbacks());
    pService->start();

    bleAdvertising = BLEDevice::getAdvertising();
    bleAdvertising->addServiceUUID(SERVICE_UUID);
    bleAdvertising->setScanResponse(true);
    bleAdvertising->setMinPreferred(0x06);
    bleAdvertising->setMaxPreferred(0x12);
    BLEDevice::startAdvertising();
    bleInicializado = true;
    bleAdvertisingAtivo = true;

    Serial.println("[OK] BLE iniciado e advertising ativo!");
    Serial.print("Nome BLE: ");
    Serial.println(NOME_DISPOSITIVO);
    Serial.println("UUID do Serviço: 6E400001-B5A3-F393-E0A9-E50E24DCCA9E");
    Serial.println("Aguardando conexão de cliente BLE...");
    Serial.println("====================================\n");
    return;
  }
  if (!bleClienteConectado && bleAdvertising && !bleAdvertisingAtivo) {
    BLEDevice::startAdvertising();
    bleAdvertisingAtivo = true;
  }
}
#endif

void enviarBLE(String msg) {
#if HAS_BLE
  if (bleClienteConectado && pCharacteristicTX != NULL) {
    pCharacteristicTX->setValue(msg.c_str());
    pCharacteristicTX->notify();
    Serial.print("[BLE] Enviado: ");
    Serial.println(msg);
  }
#else
  Serial.println(msg);
#endif
}

// Constantes - Pinos de ENTRADA (botÃµes)
const int M1 = PCF_PIN(0);
const int SE = PCF_PIN(1);
const int PT = PCF_PIN(2);
const int VZ = PCF_PIN(3);
const int DP = PCF_PIN(4);
const int SP = PCF_PIN(5);
const int DE = PCF_PIN(6);
const int DA = PCF_PIN(7);
const int SA = PIN_SA;
const int RF = PIN_RF;
int GAVETA = PIN_GAVETA;
const int ENCODER1 = PIN_ENCODER1;
const int ENCODER2 = PIN_ENCODER2;
const int ENCODER3 = PIN_ENCODER3;
const int ENCODER_TREND = PIN_ENCODER_TREND;
const int TREN_INT_DESCE = PIN_TREN_INT_DESCE;
const int INT_TREND_DESCE = PIN_INT_TREND_DESCE;
const int TREN_INT_SOBE = PIN_TREN_INT_SOBE;
const int INT_TREND_SOBE = PIN_INT_TREND_SOBE;

static void loadGavetaPinPreference() {
  Preferences p;
  if (!p.begin("cadeira", false)) {
    GAVETA = PIN_GAVETA;
    return;
  }
  GAVETA = p.getInt("gaveta_pin", PIN_GAVETA);
  p.end();
}

static void saveGavetaPinPreference() {
  Preferences p;
  if (!p.begin("cadeira", false)) {
    return;
  }
  p.putInt("gaveta_pin", GAVETA);
  p.end();
}

static bool isGavetaAberta() {
  if (ignoreGavetaLock) {
    return false;
  }
  if (GAVETA < 0) {
    return false;
  }
  return digitalRead(GAVETA) == LOW;
}

static bool isGavetaAbertaRaw() {
  if (GAVETA < 0) {
    return false;
  }
  return digitalRead(GAVETA) == LOW;
}

extern int fim_encosto_encoder;
extern int fim_asento_encoder;
extern int fim_perneira_encoder;

static void loadCalibracaoLimites() {
  Preferences p;
  if (!p.begin("cadeira", false)) {
    return;
  }
  bool done = p.getBool("cal_done", false);
  if (!done) {
    p.end();
    return;
  }
  int enc = p.getInt("encosto_max", fim_encosto_encoder);
  int ass = p.getInt("assento_max", fim_asento_encoder);
  int per = p.getInt("perneira_max", fim_perneira_encoder);
  p.end();
  if (enc > 0) fim_encosto_encoder = enc;
  if (ass > 0) fim_asento_encoder = ass;
  if (per > 0) fim_perneira_encoder = per;
  Serial.print("[CAL] Limites carregados ENC=");
  Serial.print(fim_encosto_encoder);
  Serial.print(" ASS=");
  Serial.print(fim_asento_encoder);
  Serial.print(" PER=");
  Serial.println(fim_perneira_encoder);
}

