joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
static void loadMqttPreferences() {
  Preferences p;
  if (!p.begin("mqtt", true)) {
    return;
  }
  if (p.isKey("host")) {
    mqttHost = p.getString("host", mqttHost);
  }
  if (p.isKey("port")) {
    uint32_t port = p.getUInt("port", 0);
    if (port > 0 && port <= 65535) {
      mqttPort = static_cast<uint16_t>(port);
    }
  }
  if (p.isKey("user")) {
    mqttUser = p.getString("user", "");
  }
  if (p.isKey("pass")) {
    mqttPass = p.getString("pass", "");
  }
  if (p.isKey("tls")) {
    mqttUseTls = p.getBool("tls", mqttUseTls);
  }
  if (p.isKey("cid")) {
    mqttClientId = p.getString("cid", "");
  }
  if (p.isKey("clean")) {
    mqttCleanSession = p.getBool("clean", mqttCleanSession);
  }
  p.end();
}

static void saveMqttPreferences() {
  Preferences p;
  if (!p.begin("mqtt", false)) {
    return;
  }
  p.putString("host", mqttHost);
  p.putUInt("port", mqttPort);
  p.putString("user", mqttUser);
  p.putString("pass", mqttPass);
  p.putBool("tls", mqttUseTls);
  p.putString("cid", mqttClientId);
  p.putBool("clean", mqttCleanSession);
  p.end();
}

static void applyMqttRuntimeConfig() {
  bool locked = mqttLockMs(200);
  if (!locked) {
    return;
  }
  if (mqttUseTls && mqttPort == 1883) {
    mqttPort = 8883;
  } else if (!mqttUseTls && mqttPort == 8883) {
    mqttPort = 1883;
  }
  if (mqttUseTls) {
    mqttSecureClient.setInsecure();
    mqttClient.setClient(mqttSecureClient);
  } else {
    mqttClient.setClient(mqttPlainClient);
  }
  if (WiFi.status() == WL_CONNECTED) {
    IPAddress ip;
    if (WiFi.hostByName(mqttHost.c_str(), ip) == 1) {
      mqttClient.setServer(ip, mqttPort);
      mqttUnlock();
      return;
    }
  }
  mqttClient.setServer(mqttHost.c_str(), mqttPort);
  mqttUnlock();
}

// Constantes - Pinos de SAÃDA (relÃ©s e indicadores)
#ifndef PIN_RELE_SA
#define PIN_RELE_SA 33
#endif
#ifndef PIN_RELE_DA
#define PIN_RELE_DA 25
#endif
#ifndef PIN_RELE_SE
#define PIN_RELE_SE 27
#endif
#ifndef PIN_RELE_DE
#define PIN_RELE_DE 26
#endif
#ifndef PIN_RELE_SP
#define PIN_RELE_SP 12
#endif
#ifndef PIN_RELE_DP
#define PIN_RELE_DP 14
#endif
#ifndef PIN_RELE_REFLETOR
#define PIN_RELE_REFLETOR 4
#endif
#ifndef PIN_RELE_TREND_DESCE
#define PIN_RELE_TREND_DESCE -1
#endif
#ifndef PIN_RELE_TREND_SOBE
#define PIN_RELE_TREND_SOBE -1
#endif
#ifndef PIN_LED
#define PIN_LED 2
#endif
#ifndef PIN_BUZZER
#define PIN_BUZZER 32
#endif

const int Rele_SA = PIN_RELE_SA;
const int Rele_DA = PIN_RELE_DA;
const int Rele_SE = PIN_RELE_SE;
const int Rele_DE = PIN_RELE_DE;
const int Rele_SP = PIN_RELE_SP;
const int Rele_DP = PIN_RELE_DP;
const int LED = PIN_LED;
const int Rele_refletor = PIN_RELE_REFLETOR;
const int Rele_TREND_DESCE = PIN_RELE_TREND_DESCE;
const int Rele_TREND_SOBE = PIN_RELE_TREND_SOBE;
const int BUZZER = PIN_BUZZER;

static void buzzerTestTick() {
  uint32_t now = millis();
  if (!buzzerTestEnabled) {
    if (buzzerTestIsOn) {
      digitalWrite(BUZZER, LOW);
      buzzerTestIsOn = false;
    }
    return;
  }
  if (!buzzerTestIsOn) {
    if (static_cast<int32_t>(now - buzzerTestNextOnMs) >= 0) {
      digitalWrite(BUZZER, HIGH);
      buzzerTestIsOn = true;
      buzzerTestOffAtMs = now + 80;
      buzzerTestNextOnMs = now + 2000;
    }
    return;
  }
  if (static_cast<int32_t>(now - buzzerTestOffAtMs) >= 0) {
    digitalWrite(BUZZER, LOW);
    buzzerTestIsOn = false;
  }
}

static void buzzerPulseStart2s() {
  buzzerTestEnabled = true;
  buzzerTestIsOn = false;
  buzzerTestNextOnMs = millis();
  buzzerTestOffAtMs = 0;
}

static void buzzerPulseStop() {
  buzzerTestEnabled = false;
  digitalWrite(BUZZER, LOW);
  buzzerTestIsOn = false;
}

static void beepSeqStart(uint8_t count, uint16_t onMs, uint16_t offMs) {
  if (count == 0) return;
  beepSeqRestorePulse = buzzerTestEnabled;
  buzzerPulseStop();
  beepSeqActive = true;
  beepSeqRemaining = count;
  beepSeqBuzzerOn = false;
  beepSeqOnMs = onMs;
  beepSeqOffMs = offMs;
  beepSeqNextMs = millis();
}

static void beepSeqTick() {
  if (!beepSeqActive) return;
  uint32_t now = millis();
  if (static_cast<int32_t>(now - beepSeqNextMs) < 0) return;
  if (!beepSeqBuzzerOn) {
    digitalWrite(BUZZER, HIGH);
    beepSeqBuzzerOn = true;
    beepSeqNextMs = now + beepSeqOnMs;
    return;
  }
  digitalWrite(BUZZER, LOW);
  beepSeqBuzzerOn = false;
  if (beepSeqRemaining > 0) {
    beepSeqRemaining--;
  }
  if (beepSeqRemaining == 0) {
    beepSeqActive = false;
    if (beepSeqRestorePulse) {
      buzzerPulseStart2s();
    }
    return;
  }
  beepSeqNextMs = now + beepSeqOffMs;
}

static void alarmTick() {
  if (!audibleErrorBeeps) return;
  if (beepSeqActive) return;
  if (buzzerTestEnabled) return;
  uint32_t now = millis();
  if (bootStartedAtMs == 0) {
    bootStartedAtMs = now;
  }

  bool wifiConnected = (WiFi.status() == WL_CONNECTED);
  bool mqttConnected = mqttClient.connected();

  if (wifiConnected) {
    if (wifiOkAtMs == 0) wifiOkAtMs = now;
    wifiLostAtMs = 0;
  } else if (wifiOkAtMs != 0) {
    if (wifiLostAtMs == 0) wifiLostAtMs = now;
  }

  if (mqttConnected) {
    if (mqttOkAtMs == 0) mqttOkAtMs = now;
    mqttLostAtMs = 0;
  } else if (mqttOkAtMs != 0) {
    if (mqttLostAtMs == 0) mqttLostAtMs = now;
  }

  if (alarmNextMs != 0 && static_cast<int32_t>(now - alarmNextMs) < 0) {
    return;
  }

  if (!wifiConnected) {
    if ((now - bootStartedAtMs) > 45000 || (wifiLostAtMs != 0 && (now - wifiLostAtMs) > 60000)) {
      beepSeqStart(3, 400, 150);
      alarmNextMs = now + 10000;
    }
    return;
  }

  if (!mqttConnected) {
    if ((wifiOkAtMs != 0 && (now - wifiOkAtMs) > 45000) || (mqttLostAtMs != 0 && (now - mqttLostAtMs) > 60000)) {
      beepSeqStart(3, 400, 150);
      alarmNextMs = now + 10000;
    }
    return;
  }

  if (supabaseOkAtMs == 0 && supabaseFailAtMs != 0 && (now - supabaseFailAtMs) > 60000) {
    beepSeqStart(3, 400, 150);
    alarmNextMs = now + 10000;
  }
}

static const char* relayLabelByPin(int pin) {
  if (pin == Rele_SA) return "RELE_SA";
  if (pin == Rele_DA) return "RELE_DA";
  if (pin == Rele_SE) return "RELE_SE";
  if (pin == Rele_DE) return "RELE_DE";
  if (pin == Rele_SP) return "RELE_SP";
  if (pin == Rele_DP) return "RELE_DP";
  if (pin == Rele_TREND_SOBE) return "RELE_TREND_SOBE";
  if (pin == Rele_TREND_DESCE) return "RELE_TREND_DESCE";
  if (pin == Rele_refletor) return "RELE_REFLETOR";
  if (pin == LED) return "LED";
  if (pin == BUZZER) return "BUZZER";
  return "GPIO";
}

static void setOutputPin(int pin, bool on, const char* src, bool log = true) {
  int newValue = on ? HIGH : LOW;
  int oldValue = digitalRead(pin);
  if (oldValue == newValue) {
    return;
  }
  digitalWrite(pin, newValue);
  int readBack = digitalRead(pin);
  if (pin == Rele_SA || pin == Rele_DA || pin == Rele_SE || pin == Rele_DE || pin == Rele_SP || pin == Rele_DP || pin == Rele_refletor || pin == Rele_TREND_SOBE || pin == Rele_TREND_DESCE) {
    mqttStatusDirty = true;
  }
  if (!log) {
    return;
  }
  Serial.print("[GPIO_OUT] ");
  Serial.print(relayLabelByPin(pin));
  Serial.print("(GPIO");
  Serial.print(pin);
  Serial.print(")=");
  Serial.print(on ? "1" : "0");
  Serial.print(" RB=");
  Serial.print(readBack == HIGH ? "1" : "0");
  if (src && src[0] != '\0') {
    Serial.print(" ");
    Serial.print(src);
  }
  Serial.println();
}

#if defined(I2C_SDA) && defined(I2C_SCL)
  #if (I2C_SDA == PIN_RELE_SA) || (I2C_SCL == PIN_RELE_SA)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SA"
  #endif
  #if (I2C_SDA == PIN_RELE_DA) || (I2C_SCL == PIN_RELE_DA)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DA"
  #endif
  #if (I2C_SDA == PIN_RELE_SE) || (I2C_SCL == PIN_RELE_SE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SE"
  #endif
  #if (I2C_SDA == PIN_RELE_DE) || (I2C_SCL == PIN_RELE_DE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DE"
  #endif
  #if (I2C_SDA == PIN_RELE_SP) || (I2C_SCL == PIN_RELE_SP)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_SP"
  #endif
  #if (I2C_SDA == PIN_RELE_DP) || (I2C_SCL == PIN_RELE_DP)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_DP"
  #endif
  #if (I2C_SDA == PIN_RELE_REFLETOR) || (I2C_SCL == PIN_RELE_REFLETOR)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_REFLETOR"
  #endif
  #if (I2C_SDA == PIN_RELE_TREND_DESCE) || (I2C_SCL == PIN_RELE_TREND_DESCE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_TREND_DESCE"
  #endif
  #if (I2C_SDA == PIN_RELE_TREND_SOBE) || (I2C_SCL == PIN_RELE_TREND_SOBE)
    #error "Conflito: I2C_SDA/I2C_SCL nao pode ser igual a PIN_RELE_TREND_SOBE"
  #endif
#endif

static int botaoResetWifiPin = RF;
static bool rfHabilitado = true;

