joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  // Inicializa pinos de saÃ­da
  pinMode(Rele_SA, OUTPUT);
  pinMode(Rele_DA, OUTPUT);
  pinMode(Rele_SE, OUTPUT);
  pinMode(Rele_DE, OUTPUT);
  pinMode(Rele_DP, OUTPUT);
  pinMode(Rele_SP, OUTPUT);
  pinMode(BUZZER, OUTPUT);
  digitalWrite(BUZZER, LOW);
  pinMode(LED, OUTPUT);
  pinMode(Rele_refletor, OUTPUT);
  if (Rele_TREND_DESCE >= 0) pinMode(Rele_TREND_DESCE, OUTPUT);
  if (Rele_TREND_SOBE >= 0) pinMode(Rele_TREND_SOBE, OUTPUT);

  // Desliga todos os relÃ©s no inÃ­cio
  setOutputPin(Rele_SA, false, nullptr, false);
  setOutputPin(Rele_DA, false, nullptr, false);
  setOutputPin(Rele_SE, false, nullptr, false);
  setOutputPin(Rele_DE, false, nullptr, false);
  setOutputPin(Rele_DP, false, nullptr, false);
  setOutputPin(Rele_SP, false, nullptr, false);
  setOutputPin(Rele_refletor, false, nullptr, false);
  if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, nullptr, false);
  if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, nullptr, false);
  Serial.println("Pinos configurados.");
  delay(500);

  if (RF == Rele_SA || RF == Rele_DA || RF == Rele_SE || RF == Rele_DE || RF == Rele_SP || RF == Rele_DP || RF == Rele_refletor || RF == BUZZER || RF == LED) {
    rfHabilitado = false;
    botaoResetWifiPin = -1;
    Serial.println("[ERRO] RF conflita com um pino de saida. RF desabilitado.");
  } else {
    rfHabilitado = true;
    botaoResetWifiPin = RF;
  }

  inicializaEstadosDeBordaBotoes();
  loadMotorTravelPreferences();

#if PORTS_ONLY
  Serial.println("\n=== PORTS ONLY MODE ===");
  Serial.println("Comandos: I2C_SCAN | PCF8574_PING | PCF8574_TEST | PCF8574_BTNS | GPIO_BTNS | PCF8574_INT");
  bip();
  return;
#endif

#if PORTS_VERIFY
  Serial.println("\n=== PORTS VERIFY MODE ===");
  Serial.println("Teste completo: botoes (PCF8574) -> rotinas -> reles (GPIO)");
  Serial.println("Use: PCF8574_BTNS | PCF8574_INT | GPIO_BTNS");
  bip();
  return;
#endif

  Serial.println("Inicio programa cadeira GO - Com WiFiManager + Supabase");

  // Carrega dados salvos (encoder virtual e horÃ­metro)
  Serial.println("Carregando preferencias...");
  carregaPreferencias();
  otaLoadPreferences();
  delay(500);

  // Volta CPU para 240MHz antes do WiFi
  setCpuFrequencyMhz(240);
  Serial.println("CPU em 240MHz - Iniciando WiFi...");
  delay(1000);

  // Configura e conecta WiFi usando WiFiManager
  configuraWiFiManager();

  // Inicializa MQTT se WiFi estiver conectado
  if (WiFi.status() == WL_CONNECTED) {
    mqttConnectEnabled = false;
    mqttReadyAtMs = 0;
    Serial.println("\n====================================");
    Serial.println("  INICIALIZANDO MQTT");
    Serial.println("====================================");
    applyMqttRuntimeConfig();
    mqttClient.setCallback(mqttCallback);
    Serial.print("Servidor MQTT: ");
    Serial.println(mqttHost);
    Serial.print("Porta: ");
    Serial.println(mqttPort);
    Serial.print("TLS: ");
    Serial.println(mqttUseTls ? "SIM" : "NAO");
    Serial.print("Usuario: ");
    Serial.println(mqttUser.length() > 0 ? mqttUser : "(vazio)");
    Serial.print("Base dos tópicos: ");
    Serial.println(MQTT_TOPIC_BASE);
    Serial.println("====================================\n");
  }

  if (!mqttMutex) {
    mqttMutex = xSemaphoreCreateRecursiveMutex();
  }
  if (!mqttCommandQueue) {
    mqttCommandQueue = xQueueCreate(10, sizeof(MqttCmdItem));
  }
  if (!mqttTxQueue) {
    mqttTxQueue = xQueueCreate(8, sizeof(MqttTxItem));
  }
  if (!mqttTaskHandle) {
    xTaskCreatePinnedToCore(mqttTaskMain, "mqtt", 12288, NULL, 0, &mqttTaskHandle, 0);
  }
  otaValidateAfterBoot();

  // Delay para estabilizar rede
  Serial.println("Aguardando estabilizacao da rede...");
  delay(2000);

  // Sincroniza horário com servidor NTP
  if (WiFi.status() == WL_CONNECTED) {
    sincronizaNTP();
  }

  Serial.println("\n====================================");
  Serial.println("  INICIANDO CONEXAO COM SUPABASE");
  Serial.println("====================================");
  
  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("WiFi Status: CONECTADO | IP: ");
    Serial.println(WiFi.localIP());
    Serial.print("Heap livre antes: ");
    Serial.print(ESP.getFreeHeap());
    Serial.println(" bytes");
    
    verificaStatusCadeira();
    
    Serial.print("Heap livre depois: ");
    Serial.print(ESP.getFreeHeap());
    Serial.println(" bytes");
    Serial.println("[OK] Verificacao de status concluida.");
  } else {
    Serial.println("WiFi Status: DESCONECTADO");
    Serial.println("[INFO] Pulando verificacao inicial - modo offline.");
  }

  if (WiFi.status() == WL_CONNECTED) {
    mqttConnectEnabled = true;
    mqttReadyAtMs = millis() + 1000;
    uint32_t waitUntil = millis() + 15000;
    while (!mqttClient.connected() && static_cast<int32_t>(millis() - waitUntil) < 0) {
      reconnectMQTT();
      delay(50);
    }
  }

  Serial.println("\n====================================");
  Serial.println("  EXECUTANDO VZ INICIAL");
  Serial.println("  (APOS WiFi/MQTT/Supabase)");
  Serial.println("====================================");
  executa_vz_ini();
  Serial.println("[OK] VZ inicial finalizado.");
  Serial.println("====================================\n");
  
  Serial.println("\n====================================");
  Serial.println("       SISTEMA PRONTO!");
  Serial.println("====================================");
  Serial.print("Nome: ");
  Serial.println(NOME_DISPOSITIVO);
  Serial.print("Serial: ");
  Serial.println(NUMERO_SERIE_CADEIRA);
  Serial.print("WiFi: ");
  Serial.println(WiFi.status() == WL_CONNECTED ? "ONLINE" : "OFFLINE");
  Serial.print("Memoria livre: ");
  Serial.print(ESP.getFreeHeap());
  Serial.println(" bytes");
  Serial.println("====================================");
}

static bool trendInputsConfigured() {
  return TREN_INT_DESCE >= 0 || INT_TREND_DESCE >= 0 || TREN_INT_SOBE >= 0 || INT_TREND_SOBE >= 0;
}

static bool trendReadDebouncedHigh(int pin, bool& initialized, bool& raw, bool& stable, uint32_t& changedAtMs) {
  static const uint32_t TREND_DEBOUNCE_MS = 40;
  if (pin < 0) {
    return false;
  }
  uint32_t now = millis();
  bool cur = digitalRead(pin);
  if (!initialized) {
    initialized = true;
    raw = cur;
    stable = cur;
    changedAtMs = now;
    return stable == HIGH;
  }
  if (cur != raw) {
    raw = cur;
    changedAtMs = now;
  }
  if ((now - changedAtMs) < TREND_DEBOUNCE_MS) {
    return stable == HIGH;
  }
  stable = raw;
  return stable == HIGH;
}

static void trendDebugDump(const char* tag) {
  bool hasUpPins = (TREN_INT_SOBE >= 0 || INT_TREND_SOBE >= 0);
  bool mapUpRaw = false;
  bool mapDownRaw = false;
  if (hasUpPins) {
    if (TREN_INT_SOBE >= 0 && digitalRead(TREN_INT_SOBE) == HIGH) mapUpRaw = true;
    if (INT_TREND_SOBE >= 0 && digitalRead(INT_TREND_SOBE) == HIGH) mapUpRaw = true;
  } else {
    if (INT_TREND_DESCE >= 0 && digitalRead(INT_TREND_DESCE) == HIGH) mapUpRaw = true;
  }
  if (TREN_INT_DESCE >= 0 && digitalRead(TREN_INT_DESCE) == HIGH) mapDownRaw = true;

