joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
            if (!manutencaoNecessaria && supabaseMaintenanceRequestSent) {
              supabaseMaintenanceRequestSent = false;
              preferences.begin("cadeira", false);
              preferences.putBool("mnt_sent", false);
              preferences.end();
            }
            supabaseCreateMaintenanceRequestIfNeeded();
            
            if (!cadeiraHabilitada) {
              AT_SEG();
              Serial.println("!!! CADEIRA BLOQUEADA REMOTAMENTE !!!");
              bipBloqueio();
            }
          } else {
            Serial.println("Erro: Resposta do Supabase nao e um array valido ou esta vazia");
          }
        } else {
          Serial.print("Erro ao processar JSON: ");
          Serial.println(error.c_str());
        }
      }
    } else {
      Serial.print("Erro HTTP: "); Serial.println(httpCode);
      if (supabaseFailAtMs == 0) supabaseFailAtMs = millis();
    }
    http.end();
  } else {
    Serial.println("Falha ao iniciar conexao HTTP");
    if (supabaseFailAtMs == 0) supabaseFailAtMs = millis();
  }
}

void sincronizaNTP() {
  Serial.println("[NTP] Sincronizando horario com servidor NTP...");
  // Configura NTP para horário de Brasília (GMT-3)
  configTime(-3 * 3600, 0, "pool.ntp.org", "time.nist.gov");
  
  Serial.print("[NTP] Aguardando sincronizacao");
  int tentativas = 0;
  while (time(nullptr) < 100000 && tentativas < 20) {
    Serial.print(".");
    delay(500);
    tentativas++;
  }
  
  if (time(nullptr) < 100000) {
    Serial.println("\n[ERRO] Falha ao sincronizar NTP");
  } else {
    time_t now = time(nullptr);
    Serial.println("\n[OK] Horario sincronizado!");
    Serial.print("[NTP] Data/Hora atual: ");
    Serial.println(ctime(&now));
  }
}

String getTimestamp() {
  // Retorna timestamp ISO 8601 (formato aceito pelo Supabase)
  time_t now = time(nullptr);
  struct tm timeinfo;
  
  if (!getLocalTime(&timeinfo)) {
    // Se NTP falhou, retorna NULL para Supabase usar horário do servidor
    return "null";
  }
  
  char buffer[30];
  strftime(buffer, sizeof(buffer), "%Y-%m-%dT%H:%M:%S-03:00", &timeinfo);
  return String(buffer);
}

void bipBloqueio() {
  for (int i = 0; i < 5; i++) {
    bip();
    delay(200);
  }
}

// ========== CARREGAMENTO DE PREFERÃŠNCIAS ==========
void carregaPreferencias() {
  if (!preferences.begin("cadeira", true)) {
    preferences.begin("cadeira", false);
  }
  supabaseUserId = preferences.getString("user_id", "");
  supabaseMaintenanceRequestSent = preferences.getBool("mnt_sent", false);
  preferences.end();

  if (!preferences.begin("supabase", true)) {
    preferences.begin("supabase", false);
  }
  supabaseUrl = preferences.getString("url", SUPABASE_URL);
  supabaseKey = preferences.getString("key", SUPABASE_KEY);
  if (supabaseKey.length() == 0) {
    supabaseKey = SUPABASE_KEY;
  }
  preferences.end();

  // Carrega posiÃ§Ãµes do encoder virtual M1
  if (!preferences.begin("encoder_encosto", true)) {
    preferences.begin("encoder_encosto", false);
  }
  incoder_virtual_encosto_M1 = preferences.getInt("encoder_encosto", 0);
  preferences.end();
  
  if (!preferences.begin("encoder_asento", true)) {
    preferences.begin("encoder_asento", false);
  }
  incoder_virtual_asento_M1 = preferences.getInt("encoder_asento", 0);
  preferences.end();
  
  if (!preferences.begin("encoder_perneira", true)) {
    preferences.begin("encoder_perneira", false);
  }
  incoder_virtual_perneira_M1 = preferences.getInt("encoder_perneira", 0);
  preferences.end();

  // Carrega horÃ­metro
  carregaHorimetro();

  Serial.print("Encoder encosto M1: ");
  Serial.println(incoder_virtual_encosto_M1);
  Serial.print("Encoder assento M1: ");
  Serial.println(incoder_virtual_asento_M1);
  Serial.print("Encoder perneira M1: ");
  Serial.println(incoder_virtual_perneira_M1);
}

// ========== EXECUÃ‡ÃƒO M1 VIA BLUETOOTH (sem esperar botÃ£o fÃ­sico) ==========
void executa_M1_bluetooth() {
  bip();
  
  Serial.println("Executando Memoria 1 via Bluetooth");
  faz_bt_seg = 1;
  
  while (true) {
    Watch_Dog();
    
    // Verifica parada de emergÃªncia via BLE
    if (comandoBLE.length() > 0) {
      String cmd = comandoBLE;
      comandoBLE = "";
      cmd.trim();
      cmd.toUpperCase();
      if (cmd == "AT_SEG" || cmd == "STOP") {
        AT_SEG();
        return;
      }
    }
    
    // Movimento do encosto
    if (incoder_virtual_encosto_service > incoder_virtual_encosto_M1) {
      setOutputPin(Rele_DE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service--;
      Serial.print("Encosto posicao: ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_DE, false, "M1");
      en_DE_acabou = true;
    }

    if (incoder_virtual_encosto_service < incoder_virtual_encosto_M1) {
      setOutputPin(Rele_SE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service++;
      Serial.print("Encosto posicao: ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_SE, false, "M1");
      en_SE_acabou = true;
    }

    // Movimento do assento
    if (incoder_virtual_asento_service > incoder_virtual_asento_M1) {
      setOutputPin(Rele_DA, true, "M1");
      delay(250);
      incoder_virtual_asento_service--;
      Serial.print("Assento posicao: ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_DA, false, "M1");
      en_DA_acabou = true;
    }

    if (incoder_virtual_asento_service < incoder_virtual_asento_M1) {
      setOutputPin(Rele_SA, true, "M1");
      delay(250);
      incoder_virtual_asento_service++;
      Serial.print("Assento posicao: ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_SA, false, "M1");
      en_SA_acabou = true;
    }

    // Movimento da perneira
    if (incoder_virtual_perneira_service > incoder_virtual_perneira_M1) {
      setOutputPin(Rele_DP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service--;
      Serial.print("Perneira posicao: ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_DP, false, "M1");
      en_DP_acabou = true;
    }

    if (incoder_virtual_perneira_service < incoder_virtual_perneira_M1) {
      setOutputPin(Rele_SP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service++;
      Serial.print("Perneira posicao: ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_SP, false, "M1");
      en_SP_acabou = true;
    }

    // Verifica se todos os movimentos terminaram
    if (en_SE_acabou && en_DE_acabou && en_SA_acabou && en_DA_acabou && en_SP_acabou && en_DP_acabou) {
      en_SP_acabou = false;
      en_DP_acabou = false;
      en_SE_acabou = false;
      en_DE_acabou = false;
      en_SA_acabou = false;
      en_DA_acabou = false;
      
      faz_bt_seg = 0;
      bip();
      delay(300);
      bip();
      
