joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
  buttonState = digitalRead(SE);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(DA);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(SA);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(VZ);
  if (buttonState == LOW) { AT_SEG(); }

  // Nota: RF nÃ£o chama AT_SEG pois Ã© usado para reset WiFi
  // buttonState = digitalRead(RF);
  // if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(SP);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(DP);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(PT);
  if (buttonState == LOW) { AT_SEG(); }

  buttonState = digitalRead(M1);
  if (buttonState == LOW) { AT_SEG(); }
}

// VariÃ¡veis para detecÃ§Ã£o de borda de subida nos botÃµes
static const uint32_t BUTTON_DEBOUNCE_MS = 40;
bool lastButtonState_RF = HIGH;
bool lastButtonState_SP = HIGH;
bool lastButtonState_DP = HIGH;
bool lastButtonState_DE = HIGH;
bool lastButtonState_SE = HIGH;
bool lastButtonState_SA = HIGH;
bool lastButtonState_DA = HIGH;
bool lastButtonState_GAVETA = HIGH;
bool lastButtonState_VZ = HIGH;
bool lastButtonState_M1 = HIGH;
bool lastButtonState_PT = HIGH;

bool rawButtonState_RF = HIGH;
bool rawButtonState_SP = HIGH;
bool rawButtonState_DP = HIGH;
bool rawButtonState_DE = HIGH;
bool rawButtonState_SE = HIGH;
bool rawButtonState_SA = HIGH;
bool rawButtonState_DA = HIGH;
bool rawButtonState_GAVETA = HIGH;
bool rawButtonState_VZ = HIGH;
bool rawButtonState_M1 = HIGH;
bool rawButtonState_PT = HIGH;

uint32_t rawButtonChangedAt_RF = 0;
uint32_t rawButtonChangedAt_SP = 0;
uint32_t rawButtonChangedAt_DP = 0;
uint32_t rawButtonChangedAt_DE = 0;
uint32_t rawButtonChangedAt_SE = 0;
uint32_t rawButtonChangedAt_SA = 0;
uint32_t rawButtonChangedAt_DA = 0;
uint32_t rawButtonChangedAt_GAVETA = 0;
uint32_t rawButtonChangedAt_VZ = 0;
uint32_t rawButtonChangedAt_M1 = 0;
uint32_t rawButtonChangedAt_PT = 0;

static void inicializaEstadosDeBordaBotoes() {
  uint32_t now = millis();
  lastButtonState_RF = digitalRead(RF);
  lastButtonState_SP = digitalRead(SP);
  lastButtonState_DP = digitalRead(DP);
  lastButtonState_DE = digitalRead(DE);
  lastButtonState_SE = digitalRead(SE);
  lastButtonState_SA = digitalRead(SA);
  lastButtonState_DA = digitalRead(DA);
  lastButtonState_GAVETA = digitalRead(GAVETA);
  lastButtonState_VZ = digitalRead(VZ);
  lastButtonState_M1 = digitalRead(M1);
  lastButtonState_PT = digitalRead(PT);

  rawButtonState_RF = lastButtonState_RF; rawButtonChangedAt_RF = now;
  rawButtonState_SP = lastButtonState_SP; rawButtonChangedAt_SP = now;
  rawButtonState_DP = lastButtonState_DP; rawButtonChangedAt_DP = now;
  rawButtonState_DE = lastButtonState_DE; rawButtonChangedAt_DE = now;
  rawButtonState_SE = lastButtonState_SE; rawButtonChangedAt_SE = now;
  rawButtonState_SA = lastButtonState_SA; rawButtonChangedAt_SA = now;
  rawButtonState_DA = lastButtonState_DA; rawButtonChangedAt_DA = now;
  rawButtonState_GAVETA = lastButtonState_GAVETA; rawButtonChangedAt_GAVETA = now;
  rawButtonState_VZ = lastButtonState_VZ; rawButtonChangedAt_VZ = now;
  rawButtonState_M1 = lastButtonState_M1; rawButtonChangedAt_M1 = now;
  rawButtonState_PT = lastButtonState_PT; rawButtonChangedAt_PT = now;
}

// ========== LEITURA DOS BOTÃ•ES FÃSICOS (NÃ£o bloqueante) ==========
void Button_geral() {
  if ((millis() - ultimoComandoRemoto) < 1500) return;
  if (faz_bt_seg != 0) return;

  // Para motores: comportamento "dead-man switch"
  // - Pressionou (LOW): liga e fica ligado enquanto estiver pressionado
  // - Soltou (HIGH): desliga
  // - Enquanto pressionado, renova o timeout para nao cair em TIMEOUT
  auto readMotorButton = [](int pin, bool &stableState, bool &rawState, uint32_t &rawChangedAtMs, const char* msg, bool &estadoMotor, int relayPin, bool locked, const char* lockedReason, unsigned long &ultimoCmdMs) {
    uint32_t now = millis();
    bool currentRaw = digitalRead(pin);
    if (currentRaw != rawState) {
      rawState = currentRaw;
      rawChangedAtMs = now;
    }
    if ((now - rawChangedAtMs) < BUTTON_DEBOUNCE_MS) {
      return;
    }
    bool currentState = rawState;

    if (currentState == LOW && stableState == HIGH) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 0 (PRESSIONADO)");
      if (locked) {
        Serial.print("Comando "); Serial.print(msg); Serial.print(" bloqueado ("); Serial.print(lockedReason); Serial.println(")");
        if (lockedReason && String(lockedReason) == "limite") {
          Serial.print("[LIMIT] IGNORE="); Serial.print(ignoreLimitLocks ? "1" : "0");
          Serial.print(" ENC="); Serial.print(incoder_virtual_encosto_service);
          Serial.print(" ASS="); Serial.print(incoder_virtual_asento_service);
          Serial.print(" PER="); Serial.println(incoder_virtual_perneira_service);
        } else if (lockedReason && String(lockedReason) == "gaveta") {
          Serial.println("[GAVETA] Aberta - perneira bloqueada");
        }
      }
      if (!locked) {
        mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", msg, false);
      }
    }

    if (currentState == HIGH && stableState == LOW) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 1 (SOLTO)");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "STOP", false);
    }

    if (currentState == LOW && !locked) {
      ultimoCmdMs = millis();
      if (!estadoMotor) {
        estadoMotor = true;
        setOutputPin(relayPin, true, msg);
        Serial.print("Comando "); Serial.print(msg); Serial.println(" acionado");
      }
    } else {
      if (estadoMotor) {
        estadoMotor = false;
        setOutputPin(relayPin, false, msg);
      }
    }

    stableState = currentState;
  };

  // Para botoes de toggle (ex: refletor)
  auto readToggleButton = [](int pin, bool &stableState, bool &rawState, uint32_t &rawChangedAtMs, const char* msg, bool &toggleVar, int relayPin) {
    uint32_t now = millis();
    bool currentRaw = digitalRead(pin);
    if (currentRaw != rawState) {
      rawState = currentRaw;
      rawChangedAtMs = now;
    }
    if ((now - rawChangedAtMs) < BUTTON_DEBOUNCE_MS) {
      return;
    }
    bool currentState = rawState;

    if (currentState == LOW && stableState == HIGH) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 0 (PRESSIONADO)");
      toggleVar = !toggleVar;
      setOutputPin(relayPin, toggleVar, msg);
      Serial.print("Comando "); Serial.print(msg); Serial.println(" acionado");
      mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", msg, false);
    } else if (currentState == HIGH && stableState == LOW) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 1 (SOLTO)");
    }
    stableState = currentState;
  };

  auto readInputOnly = [](int pin, bool &stableState, bool &rawState, uint32_t &rawChangedAtMs, const char* msg) {
    if (pin < 0) {
      return;
    }
    uint32_t now = millis();
    bool currentRaw = digitalRead(pin);
    if (currentRaw != rawState) {
      rawState = currentRaw;
      rawChangedAtMs = now;
    }
    if ((now - rawChangedAtMs) < BUTTON_DEBOUNCE_MS) {
      return;
    }
    bool currentState = rawState;
    if (currentState == LOW && stableState == HIGH) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 0 (PRESSIONADO)");
      if (String(msg) == "GAVETA") {
        enviarBLE("GAVETA:OPEN");
        mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_OPEN", false);
        mqttStatusDirty = true;
      }
    } else if (currentState == HIGH && stableState == LOW) {
      Serial.print("[GPIO_INT] Botao "); Serial.print(msg); Serial.print(" (Pino "); Serial.print(pin); Serial.println(") = 1 (SOLTO)");
      if (String(msg) == "GAVETA") {
        enviarBLE("GAVETA:CLOSED");
        mqttEnqueuePublish(MQTT_TOPIC_BASE + "tx_cmd", "GAVETA_CLOSED", false);
        mqttStatusDirty = true;
      }
    }
    stableState = currentState;
  };

  if (rfHabilitado) {
    readToggleButton(RF, lastButtonState_RF, rawButtonState_RF, rawButtonChangedAt_RF, "RF", estado_r, Rele_refletor);
  }
  readInputOnly(GAVETA, lastButtonState_GAVETA, rawButtonState_GAVETA, rawButtonChangedAt_GAVETA, "GAVETA");
  bool gavetaAberta = isGavetaAberta();
  readMotorButton(SP, lastButtonState_SP, rawButtonState_SP, rawButtonChangedAt_SP, "SP", estado_sp, Rele_SP, (!ignoreLimitLocks && trava_bt_SP) || gavetaAberta, gavetaAberta ? "gaveta" : "limite", ultimoComandoSP);
  readMotorButton(DP, lastButtonState_DP, rawButtonState_DP, rawButtonChangedAt_DP, "DP", estado_dp, Rele_DP, (!ignoreLimitLocks && trava_bt_DP) || gavetaAberta, gavetaAberta ? "gaveta" : "limite", ultimoComandoDP);
  readMotorButton(DE, lastButtonState_DE, rawButtonState_DE, rawButtonChangedAt_DE, "DE", estado_de, Rele_DE, !ignoreLimitLocks && trava_bt_DE, "limite", ultimoComandoDE);
  readMotorButton(SE, lastButtonState_SE, rawButtonState_SE, rawButtonChangedAt_SE, "SE", estado_se, Rele_SE, !ignoreLimitLocks && trava_bt_SE, "limite", ultimoComandoSE);
  readMotorButton(SA, lastButtonState_SA, rawButtonState_SA, rawButtonChangedAt_SA, "SA", estado_sa, Rele_SA, !ignoreLimitLocks && trava_bt_SA, "limite", ultimoComandoSA);
  readMotorButton(DA, lastButtonState_DA, rawButtonState_DA, rawButtonChangedAt_DA, "DA", estado_da, Rele_DA, !ignoreLimitLocks && trava_bt_DA, "limite", ultimoComandoDA);

  // Botões de funções especiais (VZ, M1, PT)
  {
    uint32_t now = millis();
    bool currRaw = digitalRead(VZ);
    if (currRaw != rawButtonState_VZ) {
      rawButtonState_VZ = currRaw;
      rawButtonChangedAt_VZ = now;
    }
    if ((now - rawButtonChangedAt_VZ) >= BUTTON_DEBOUNCE_MS) {
      bool curr = rawButtonState_VZ;
      if (curr == LOW && lastButtonState_VZ == HIGH) {
        Serial.print("[GPIO_INT] Botao VZ (Pino "); Serial.print(VZ); Serial.println(") = 0 (PRESSIONADO)");
        Serial.println("Comando VZ acionado");
        cont = 1;
        executa_vz();
      } else if (curr == HIGH && lastButtonState_VZ == LOW) {
        Serial.print("[GPIO_INT] Botao VZ (Pino "); Serial.print(VZ); Serial.println(") = 1 (SOLTO)");
      }
      lastButtonState_VZ = curr;
    }
  }

  {
    uint32_t now = millis();
    bool currRaw = digitalRead(M1);
    if (currRaw != rawButtonState_M1) {
      rawButtonState_M1 = currRaw;
      rawButtonChangedAt_M1 = now;
    }
    if ((now - rawButtonChangedAt_M1) >= BUTTON_DEBOUNCE_MS) {
      bool curr = rawButtonState_M1;
      if (curr == LOW && lastButtonState_M1 == HIGH) {
        Serial.print("[GPIO_INT] Botao M1 (Pino "); Serial.print(M1); Serial.println(") = 0 (PRESSIONADO)");
        Serial.println("Comando M1 acionado");
        executa_M1();
      } else if (curr == HIGH && lastButtonState_M1 == LOW) {
        Serial.print("[GPIO_INT] Botao M1 (Pino "); Serial.print(M1); Serial.println(") = 1 (SOLTO)");
      }
      lastButtonState_M1 = curr;
    }
  }

  {
    uint32_t now = millis();
    bool currRaw = digitalRead(PT);
    if (currRaw != rawButtonState_PT) {
      rawButtonState_PT = currRaw;
      rawButtonChangedAt_PT = now;
    }
    if ((now - rawButtonChangedAt_PT) >= BUTTON_DEBOUNCE_MS) {
      bool curr = rawButtonState_PT;
      if (curr == LOW && lastButtonState_PT == HIGH) {
        Serial.print("[GPIO_INT] Botao PT (Pino "); Serial.print(PT); Serial.println(") = 0 (PRESSIONADO)");
        Serial.println("Comando PT acionado");
        cont13 = 1;
        executa_pt();
      } else if (curr == HIGH && lastButtonState_PT == LOW) {
        Serial.print("[GPIO_INT] Botao PT (Pino "); Serial.print(PT); Serial.println(") = 1 (SOLTO)");
      }
      lastButtonState_PT = curr;
    }
  }
}

void iniciaCalibracaoSeNecessario() {
  Preferences p;
  p.begin("cadeira", false);
  bool done = p.getBool("cal_done", false);
  p.end();
  if (!done) {
    executaCalibracao();
  }
}

