joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
    // Proteção contra overflow (15 segundos = 15000ms)
    if (contador >= 15000 || contador < 0) {
      setOutputPin(Rele_SA, false, "PT");
      setOutputPin(Rele_DE, false, "PT");
      setOutputPin(Rele_SP, false, "PT");
      cont13 = 0;
      contador = 0;

      bip();
      buzzerPulseStop();
      faz_bt_seg = 0;
      Serial.println("Fim PT");
      enviarBLE("PT:DONE");
    }
  }
}

// ========== EXECUÃ‡ÃƒO DA MEMÃ“RIA M1 (via botÃ£o fÃ­sico) ==========
void executa_M1() {
  buttonState = digitalRead(M1);
  while (buttonState == LOW) {
    buttonState = digitalRead(M1);
    cont12++;

    if (cont12 < 500) {
      Serial.println("Contando tempo botao Memoria 1");
      Serial.print("cont12 = ");
      Serial.println(cont12);
    } else {
      Serial.println("Executando M1");
      faz_m1 = true;
      bip();
      delay(200);
      bip();
      delay(200);
      cont12 = 0;

      Serial.println("Executando Memoria 1");
      Serial.print("Posicao do encosto = ");
      Serial.println(incoder_virtual_encosto_service);
      Serial.print("Posicao do assento = ");
      Serial.println(incoder_virtual_asento_service);
      Serial.print("Posicao da perneira = ");
      Serial.println(incoder_virtual_perneira_service);
    }
  }

  cont12 = 0;

  // Se pressionou rÃ¡pido, salva a posiÃ§Ã£o atual
  if (faz_m1 == false) {
    incoder_virtual_encosto_M1 = incoder_virtual_encosto_service;
    incoder_virtual_asento_M1 = incoder_virtual_asento_service;
    incoder_virtual_perneira_M1 = incoder_virtual_perneira_service;

    preferences.begin("encoder_encosto", false);
    preferences.putInt("encoder_encosto", incoder_virtual_encosto_M1);
    preferences.end();
    
    preferences.begin("encoder_asento", false);
    preferences.putInt("encoder_asento", incoder_virtual_asento_M1);
    preferences.end();
    
    preferences.begin("encoder_perneira", false);
    preferences.putInt("encoder_perneira", incoder_virtual_perneira_M1);
    preferences.end();

    Serial.println("Posicoes de memoria gravadas");
    Serial.print("Posicao do encosto na memoria = ");
    Serial.println(incoder_virtual_encosto_M1);
    Serial.print("Posicao do assento na memoria = ");
    Serial.println(incoder_virtual_asento_M1);
    Serial.print("Posicao da perneira na memoria = ");
    Serial.println(incoder_virtual_perneira_M1);

    enviarBLE("M1:SAVED");
    supabaseSaveMemoryPosition(1);

    bip();
    delay(200);
    bip();
  }

  // Se segurou o botÃ£o, executa o movimento para a posiÃ§Ã£o salva
  while (faz_m1 == true) {
    Watch_Dog();

    faz_bt_seg = 1;
    Button_Seg();

    if (faz_bt_seg == 0) {
      bip();
      delay(700);
      bip();
      faz_m1 = false;
      return;
    }

    // Movimento do Encosto
    if (incoder_virtual_encosto_service > incoder_virtual_encosto_M1) {
      setOutputPin(Rele_DE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service--;
      Serial.print("Posicao encoder virtual encosto = ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_DE, false, "M1");
      en_DE_acabou = true;
    }

    if (incoder_virtual_encosto_service < incoder_virtual_encosto_M1) {
      setOutputPin(Rele_SE, true, "M1");
      delay(250);
      incoder_virtual_encosto_service++;
      Serial.print("Posicao encoder virtual encosto = ");
      Serial.println(incoder_virtual_encosto_service);
    } else {
      setOutputPin(Rele_SE, false, "M1");
      en_SE_acabou = true;
    }

    // Movimento do Assento
    if (incoder_virtual_asento_service > incoder_virtual_asento_M1) {
      setOutputPin(Rele_DA, true, "M1");
      delay(250);
      incoder_virtual_asento_service--;
      Serial.print("Posicao encoder virtual assento = ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_DA, false, "M1");
      en_DA_acabou = true;
    }

    if (incoder_virtual_asento_service < incoder_virtual_asento_M1) {
      setOutputPin(Rele_SA, true, "M1");
      delay(250);
      incoder_virtual_asento_service++;
      Serial.print("Posicao encoder virtual assento = ");
      Serial.println(incoder_virtual_asento_service);
    } else {
      setOutputPin(Rele_SA, false, "M1");
      en_SA_acabou = true;
    }

    // Movimento da Perneira
    if (incoder_virtual_perneira_service > incoder_virtual_perneira_M1) {
      setOutputPin(Rele_DP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service--;
      Serial.print("Posicao encoder virtual perneira = ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_DP, false, "M1");
      en_DP_acabou = true;
    }

    if (incoder_virtual_perneira_service < incoder_virtual_perneira_M1) {
      setOutputPin(Rele_SP, true, "M1");
      delay(250);
      incoder_virtual_perneira_service++;
      Serial.print("Posicao encoder virtual perneira = ");
      Serial.println(incoder_virtual_perneira_service);
    } else {
      setOutputPin(Rele_SP, false, "M1");
      en_SP_acabou = true;
    }

    // Verifica se todos os movimentos terminaram
    if (en_SE_acabou == true && en_DE_acabou == true && en_SA_acabou == true && en_DA_acabou == true && en_SP_acabou == true && en_DP_acabou == true) {
      faz_m1 = false;
      en_SP_acabou = false;
      en_DP_acabou = false;
      en_SE_acabou = false;
      en_DE_acabou = false;
      en_SA_acabou = false;
      en_DA_acabou = false;

      bip();
      delay(500);
      bip();

      Serial.println("Fim do movimento da memoria 1");
      enviarBLE("M1:DONE");
      return;
    }
  }
}

// ========== PARADA DE EMERGÃŠNCIA (AT_SEG) ==========
void AT_SEG() {
  if (faz_bt_seg == 1) {
    Serial.println("Parando todos os movimentos");
    enviarBLE("AT_SEG:STOPPING");

    setOutputPin(Rele_DE, false, "AT_SEG");
    setOutputPin(Rele_SE, false, "AT_SEG");
    setOutputPin(Rele_SA, false, "AT_SEG");
    setOutputPin(Rele_DA, false, "AT_SEG");
    setOutputPin(Rele_SP, false, "AT_SEG");
    setOutputPin(Rele_DP, false, "AT_SEG");
    if (Rele_TREND_SOBE >= 0) setOutputPin(Rele_TREND_SOBE, false, "AT_SEG");
    if (Rele_TREND_DESCE >= 0) setOutputPin(Rele_TREND_DESCE, false, "AT_SEG");

    // Atualiza estados
    estado_de = false;
    estado_se = false;
    estado_sa = false;
    estado_da = false;
    estado_sp = false;
    estado_dp = false;
    estado_trend_sobe = false;
    estado_trend_desce = false;

    faz_bt_seg = 0;
    cont = 0;
    cont13 = 0;
  }
  delay(100);
}

// ========== BIP (buzzer) ==========
void bip() {
  digitalWrite(BUZZER, HIGH);
  delay(100);
  digitalWrite(BUZZER, LOW);
}

