joselazarolourencojunior-bot/Cadeira_odontologica/ESP32/esp32_bluetooth_chair/src/main.cpp
void bipLong() {
  digitalWrite(BUZZER, HIGH);
  delay(400);
  digitalWrite(BUZZER, LOW);
}

// ========== MONITORAMENTO DO SISTEMA (DEBUG) ==========
void monitoraSistema() {
  if (millis() - ultimoMonitoramentoSistema < INTERVALO_MONITORAMENTO) return;
  ultimoMonitoramentoSistema = millis();

  Serial.println("--- MONITORAMENTO DO SISTEMA ---");
  Serial.print("Free Heap: "); Serial.print(ESP.getFreeHeap() / 1024); Serial.println(" KB");
  Serial.print("Min Free Heap: "); Serial.print(ESP.getMinFreeHeap() / 1024); Serial.println(" KB");
  Serial.print("WiFi Status: "); 
  switch(WiFi.status()) {
    case WL_CONNECTED: Serial.println("CONECTADO"); break;
    case WL_DISCONNECTED: Serial.println("DESCONECTADO"); break;
    case WL_CONNECTION_LOST: Serial.println("CONEXAO PERDIDA"); break;
    default: Serial.println(WiFi.status()); break;
  }
  if (WiFi.status() == WL_CONNECTED) {
    Serial.print("IP: "); Serial.println(WiFi.localIP());
    Serial.print("RSSI: "); Serial.println(WiFi.RSSI());
  }
#if HAS_BLE
  Serial.print("BLE Status: "); 
  Serial.println(bleClienteConectado ? "CONECTADO" : "AGUARDANDO CONEXAO");
  if (bleClienteConectado && pServer != NULL) {
    Serial.print("BLE Clientes: "); 
    Serial.println(pServer->getConnectedCount());
  }
#else
  Serial.println("BLE Status: NA");
#endif
  Serial.print("Horimetro: "); Serial.println(horimetro);
  Serial.print("Cadeira Habilitada: "); Serial.println(cadeiraHabilitada ? "SIM" : "NAO");
  if (!cadeiraHabilitada && !buzzerTestEnabled) {
    bip(); delay(120);
    bip(); delay(120);
    bip();
  }
  Serial.print("MQTT Status: ");
  bool mqttConnected = mqttClient.connected();
  String hostSnapshot;
  uint16_t portSnapshot = 0;
  bool tlsSnapshot = false;
  String clientIdSnapshot;
  bool cleanSnapshot = true;
  if (mqttLockMs(20)) {
    hostSnapshot = mqttHost;
    portSnapshot = mqttPort;
    tlsSnapshot = mqttUseTls;
    clientIdSnapshot = mqttClientId;
    cleanSnapshot = mqttCleanSession;
    mqttUnlock();
  } else {
    hostSnapshot = mqttHost;
    portSnapshot = mqttPort;
    tlsSnapshot = mqttUseTls;
    clientIdSnapshot = mqttClientId;
    cleanSnapshot = mqttCleanSession;
  }
  Serial.print(mqttConnected ? "CONECTADO " : "DESCONECTADO ");
  Serial.print("HOST=");
  Serial.print(hostSnapshot);
  Serial.print(" PORT=");
  Serial.print(portSnapshot);
  Serial.print(" TLS=");
  Serial.println(tlsSnapshot ? "SIM" : "NAO");
  Serial.print("MQTT CLIENT_ID: ");
  Serial.println(clientIdSnapshot.length() > 0 ? clientIdSnapshot : ("ESP32-" + NUMERO_SERIE_CADEIRA));
  Serial.print("MQTT CLEAN: ");
  Serial.println(cleanSnapshot ? "1" : "0");
  Serial.print("MQTT RX: "); Serial.print(mqttRxCount);
  Serial.print(" TX: "); Serial.println(mqttTxCount);
  if (mqttLastRxMs) {
    Serial.print("Ultimo MQTT RX: ");
    Serial.print((millis() - mqttLastRxMs) / 1000);
    Serial.println("s");
  }
  if (mqttLastTxMs) {
    Serial.print("Ultimo MQTT TX: ");
    Serial.print((millis() - mqttLastTxMs) / 1000);
    Serial.println("s");
  }
  
  // Contadores de tempo para próximas atualizações
  unsigned long tempoAtual = millis();
  unsigned long tempoAteProximoHorimetro = 0;
  unsigned long tempoAteProximaVerificacao = 0;
  
  if (tempoAtual - ultimaAtualizacaoSupabase < INTERVALO_ATUALIZACAO_SUPABASE) {
    tempoAteProximoHorimetro = (INTERVALO_ATUALIZACAO_SUPABASE - (tempoAtual - ultimaAtualizacaoSupabase)) / 1000;
  }
  
  if (tempoAtual - ultimaVerificacaoStatus < INTERVALO_VERIFICACAO_STATUS) {
    tempoAteProximaVerificacao = (INTERVALO_VERIFICACAO_STATUS - (tempoAtual - ultimaVerificacaoStatus)) / 1000;
  }
  
  Serial.print("Proximo envio horimetro: "); Serial.print(tempoAteProximoHorimetro); Serial.println("s");
  Serial.print("Proxima verificacao status: "); Serial.print(tempoAteProximaVerificacao); Serial.println("s");
  
#if USE_PCF8574
  // Removido a impressao constante daqui
#endif

  Serial.println("--------------------------------");
}

